# Курс "Python для анализа данных"

---
# Домашнее задание PRO
#4.1.1 Работа с объектами Series, DataFrame. Переиндексация, доступ по индексу, выборка, фильтрация

In [1]:
# Запустите код ниже для старта, но не правьте во избежания ошибок проверки!
_HOMEWORK_NAME_ = '4.1.1_PRO'
_HOMEWORK_ANSWER_DICT_ = dict()

## ФИО участника

In [2]:
# Введите ваше имя и фамилию в соответствующую позицию 'NAME' и 'LAST_NAME'!
_NAME_SERNAME_ = {
    'NAME' : 'Vladimir',
    'LAST_NAME' : 'Doronin'
}

## Задание 1

**Условие:** 
Создайте массив ```ndarray``` размера ```20``` элементов, взятых из стандартного нормального распределения, используя модуль ```scipy.stats```. Создайте объект ```pd.Series```, значениями которого являются элементы созданого массива, а индексы взяты по умолчанию.  Найдите сумму индексов всех отрицательных элементов в полученном объекте, используя фильтрацию. 

**Формат ответа:** 
Число (например, ```10```)

**Оценка в баллах:** 4 балла

**Решение:**

In [15]:
from scipy import stats
import pandas as pd
import numpy as np

a = stats.norm.rvs(size=20)
a = pd.Series(a)
ans1_ = a[a<0]
ans1__ = ans1_.index.to_list()
ans1 = np.sum(ans1__)
print(ans1)

76

**Ответ:**

In [16]:
# Не изменяйте текст до знака = во избежании ошибок проверки!
_HOMEWORK_ANSWER_DICT_['A1'] = ans1

## Задание 2

**Условие:** 
Используя ```DataFrame```, указанный в Решении, найдите сумму всех значений, стоящих в строках до ```'Colorado'``` включительно и в столбцах до 3го столбца, не включая его. Используйте методы объекта ```DataFrame```.

**Формат ответа:** 
Строка (например, ```'New York 	'```)

**Оценка в баллах:** 3 балла

**Решение:**

In [19]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data = data.iloc[:2, :2]
ans2 = data.values.sum()

**Ответ:**

In [27]:
# Не изменяйте текст до знака = во избежании ошибок проверки!
_HOMEWORK_ANSWER_DICT_['A2'] = ans2

## Задание 3

**Условие:** 
Используя ```DataFrame```, указанный в Решении, найдите определитель матрицы, составленной из значений, стоящих на пересечении строк ```'Ohio'```,  ```'Utah'``` со столбцами под номерами 1 и 3. Используйте методы объекта ```DataFrame``` и библиотеки ```scipy```.

**Формат ответа:** 
Число (например, ```1.5```)

**Оценка в баллах:** 4 балла

**Решение:**

In [28]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
data = data.loc[['Ohio', 'Utah'], ['one', 'three']]
data

      one  three
Ohio    0      2
Utah    8     10

In [31]:
from scipy import linalg

data = data.values
ans3 = linalg.det(data)

In [32]:
ans3

-16.0

**Ответ:**

In [33]:
# Не изменяйте текст до знака = во избежании ошибок проверки!
_HOMEWORK_ANSWER_DICT_['A2'] = ans3

## Комментарии участника

In [ ]:
_YOUR_COMMENT_ = 'All right!'

## Создание отчета

In [ ]:
# Проверьте правильность заполнения полей и 
# выполните данный код для создания отчета
# и сохранения на локальную машину
from google.colab import files
import json
try:
  # form a report
  _HM_REPORT_ = {'Answers':_HOMEWORK_ANSWER_DICT_,
                'Comment':_YOUR_COMMENT_,
                'User':_NAME_SERNAME_,
                }

  # create a report name
  _REPORT_NAME_ = 'HM_' +\
                    _HOMEWORK_NAME_ + \
                  '_by_' + \
                  _NAME_SERNAME_['LAST_NAME'] + \
                  '.json'
  
  # Save a report to a file
  f = open(_REPORT_NAME_,"w")
  f.write(json.dumps(_HM_REPORT_))
  f.close()

  # Donwnload the file into a local host
  files.download(_REPORT_NAME_) 
  print('Thanks for the work, {name}!'.format(name=_NAME_SERNAME_['NAME']))
except Exception as error:
   print(error)
   print('Something went wrong! Check the data entry and try again!')

TypeError: NetworkError when attempting to fetch resource.
Something went wrong! Check the data entry and try again!